[
    {
    "version" : "0.0.3",
    "Title" : "Version 0.0.3 - Beta : A Lighter, Smarter Core.",
    "Features": [
      "Introduced Realms: isolated environments similar to browser profiles for organizing your workspace.",
      "Added Entries Viewer: a unified table that displays data from all tools in one organized and readable view."
    ],
    "Fixes": [
    ],
    "Improvements": [
      "Switched to Tauri: Hollow now runs on Tauri instead of Electron, resulting in a smaller app size and significantly faster performance.",
      "Rewrote the UI using SolidJS instead of React for better performance and responsiveness.",
      "Revamped the plugin system to be simpler and more developer friendly.",
      "Redesigned UI layout: side popups no longer overlap or interfere with other elements.",
      "Tool settings are now handled through a predefined layout, so tools no longer need to build their own settings component."
    ],
    "Date" : "2025-08-01T00:00:00+01:00"
  },
  {
    "version" : "0.0.2",
    "Title" : "Version 0.0.2 - Beta.",
    "Features": [
      "Implemented a simple notification system.",
      "Introduced a flexible context menu.",
      "Added borders to cards for enhanced visual distinction.",
      "Integrated a universal color/emoji picker.",
      "Introduced Developer Mode for plugin developers.",
      "Enabled context menu integration for plugins."
    ],
    "Fixes": [
    "Resolved issues with card theme logic by utilizing raw CSS files ( experimental ).",
    "Eliminated unnecessary shading in the editor, prioritizing dynamic light/dark color adaptation."
    ],
    "Improvements": [
      "Enhanced application performance for smoother and more responsive interactions, reducing loading times.",
      "Integrated macOS native UI elements for better system consistency.",
      "Made tool settings and all popups static for improved stability.",
      "Replaced the zoom feature with a drag-based scrolling mechanism, enabling faster and more efficient navigation.",
      "Notebook - Enabled cover image display on notes.",
      "Notebook - Redesigned interface for improved usability.",
      "Notebook - Introduced an inline editor.",
      "Notebook - Removed split view in the full editor, replacing it with a lightweight WYSIWYG editor.",
      "Kanban - Refined interface for better clarity."
    ],
    "Date" : "2025-01-29T00:00:00+01:00"
  },
  {
    "version" : "0.0.1",
    "Title" : "Version 0.0.1 - Initial Release.",
    "Features" : ["Time to be creative.", "Explore hollow's core tools and shape them to what you like them to be."] ,
    "Fixes" : [],
    "Improvements" : [],
    "Date" : "2024-12-30T00:00:00+01:00"
  }
]
